# TryParse Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UnitFormatUtils..::..TryParse Method
UnitFormatUtils Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TryParse(Units, ForgeTypeId, String, Double%) | Parses a formatted string into a number with units if possible. |
| TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double%) | Parses a formatted string into a number with units if possible. |
| TryParse(Units, ForgeTypeId, String, Double%, String%) | Parses a formatted string into a number with units if possible. |
| TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double%, String%) | Parses a formatted string into a number with units if possible. |

# See Also
UnitFormatUtils Class
UnitFormatUtils Members
Autodesk.Revit.DB Namespace